controllers/AdminController.php

SELECT * FROM `products` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Products::findOne($id)) !== null) {