controllers/CheckoutController.php

	public function actionIndex()
	{
		$cart = Yii::$app->session->get("cart", []);
		$ids = array_keys($cart);
		$products = Products::findAll($ids);
---
SELECT * FROM `products` WHERE 0=1