controllers/ProductsController.php

SELECT COUNT(*) FROM `products` WHERE `status`=1
SELECT * FROM `products` WHERE `status`=1 ORDER BY `created_at` LIMIT 3
---
	public function actionIndex()
	{
		$query = Products::find()
			->where(["status" => 1]);

		$pagination = new Pagination([
			'defaultPageSize' => 3,
			'totalCount' => $query->count()
		]);

		$products = $query->orderBy("created_at")
			->offset($pagination->offset)
			->limit($pagination->limit)
			->all();

SELECT * FROM `products` WHERE `id`='2'
---
	public function actionProduct($id)
	{
		$product = Products::findOne($id);

SELECT * FROM `categories` WHERE `id`='1'
---
	public function actionCategory($category)
	{
		$category = Categories::findOne($category);