controllers/SiteController.php

SELECT * FROM `products` WHERE (`hot`=1) AND (`status`=1) LIMIT 4
---
    public function actionIndex()
    {
        $products = Products::find()
            ->where(["hot" => 1, "status" => 1])
            ->limit(4)
            ->all();